# InverseDegreesCelsius Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..InverseDegreesCelsius Property
UnitTypeId Class See Also
---
Inverse degrees Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InverseDegreesCelsius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InverseDegreesCelsius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InverseDegreesCelsius {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace